[
    {
        "Title": "Interested in understanding and becoming more knowledgeable on stocks.",
        "Content": "Recently I have fallen into the rabbit hole on youtube and social media looking into stocks and how people are so well at understanding any and everything when it comes to the topic. I am late to the stock market and I feel have some basic knowledge but I still don't know where to start? any recommendations or tips on where to begin learning or where to get advice on how to understand it all?"
    },
    {
        "Title": "At 36, are these allocations OK?",
        "Content": "Since 2025 is close, I’ve been wondering if my investment allocations are still fine. My only goals are to eventually move to Mexico and not work forever.\n\nAllocations:\n\nEmployer Profit sharing: 100% VTSAX\n\nRoth IRA: 60% FSKAX, 40% VTSAX\n\nBrokerage #1: 100% TSLA (small amount)\n\nBrokerage #2: VMFXX (money market) 64%, VOO 14%\n\nI also have 12 months of expenses saved up since I’m in the oil and gas industry (it’s a rollercoaster). I can probably be Ok with just 6 months of expenses and invest the remainder. I just don’t know what to invest in. Do I just continue with VTSAX/FSKAX or add to VOO? \n\nI guess I’m just looking to maximize growth. Is there anything you would do differently based on those allocations? I assume the funds in VMFXX should actually be invested instead of just sitting there earning 4.57%..\n\nI appreciate any feedback you can provide.\n\nThanks!\n\n"
    },
    {
        "Title": "Expected returns have gotten insane.",
        "Content": "I see posts and comments from people all the time complaining about how some company they’re invested in is just complete shit and then you check and it’s up 60% on the year. Not every stock is gonna be 2024 NVDA! People’s expectations have just gotten crazy. "
    },
    {
        "Title": "Protecting Gains on 300 META Shares Without Selling: Selling Deep ITM Calls Strategy",
        "Content": "\nI currently hold 300 shares of META that I purchased back in March and have seen decent gains. I want to protect these profits without triggering taxes from selling before the one-year mark (to qualify for long-term capital gains).\n\nI’m considering selling deep in-the-money (ITM) calls with March expiration. These options would expire shortly after my one-year holding period, so my shares would be eligible for long-term capital gains if exercised after expiration.\n\nI understand that selling deep ITM calls could constrain my margin account while the options are open. Aside from that, are there any other risks or pitfalls I should be aware of with this strategy? For example:\n\t•\tCould this strategy be flagged as a “constructive sale” by the IRS?\n\t•\tWhat happens if the calls are exercised before the March expiration?\n\t•\tAre there better alternatives to hedge while preserving my tax situation?\n\n\nThanks - "
    },
    {
        "Title": "realty income REIT hypotetical",
        "Content": "i think 10%ish of their properties have failing business like dollar general and walgreens.\n\nfor purposes of this hypothetical, assume these companies will continue to shrink, so also assume this part of their portfolio is freed up.\n\nit seems that no similar business would rent there anymore.\n\nit seems different types of businesses wouldnt want to rent there bc those buildings and locations seem specifically tailored and niche to the previous renters business model.\n\nwhat does O do? sell them? hold them and hope for their tenant's recovery?\n\nedit: dollar general is a store that opens in the worst places. they succeed bc not many other businesses want the location so they just take on terrible conditions to serve a consumer that has no options. this is why i think if they fail, there's not many other businesses who would want to rent these locations. walgreens isnt exactly like this, but it has a similar problem."
    },
    {
        "Title": "'Expects Roku to be bought for a \"large premium\", Ad viewing across programs gives it pricing power' - Needham analyst (Laura Martin)",
        "Content": "Needham analyst talking to Bloomberg: \n\nhttps://www.bloomberg.com/news/videos/2024-12-04/needham-sees-acquisition-appeal-for-roku-video\n\nFrom Interactive Brokers commentary:\n\n&gt; Needham analyst Laura Martin reiterated a Buy rating and $100.00 price target on Roku Inc. ROKU.\n\n&gt; The analyst commented: \"Yesterday, Walmart closed its $2.3B acquisition of Vizio, which was announced in Feb 2024. Walmart's urgent need was driven by AMZN's decision to make all 200mm of its Prime Video subscribers ad- driven in Jan 2024. AMZN then linked its CTV ads to actual purchases made on its site, thereby creating the first RMN (retail media network) with \"closed-loop attribution\". Walmart will now \"fast follow\" AMZN and create a better RMN by tying Vizio's CTV ads to Walmart's online and offline sales.\n\n&gt; We expect Roku to be purchased for a large premium within the next 12 months. We believe that there are several categories of potential purchasers including streamers (NFLX, etc), CTV ad buyers (TTD, etc), retailers (Target, etc), and LLMs (large language models) hungry for billions of new data points daily (AMZN/AWS, MSFT/OpenAI, GOOGL/YouTube/Gemini, etc). The top 6 reasons to acquire Roku (our view) include its installed base, unique data sets, pricing power, shelf space, buy vs build advantages, and the fact that it's now the only scaled CTV platform that can be purchased"
    },
    {
        "Title": "Gonna sell my etf. Which one do I let go? Qqq or vti",
        "Content": "There is a lot of overlap between those 2.But qqq is more tech heavy and it has profited more for me over the last few years. I'm selling some to buy other assets.\n\nWhich should I keep in this climate? All advice appreciated. "
    },
    {
        "Title": "Downsides of FEPI",
        "Content": "So I just found out about FEPI, and went into a rabbit hole of info on it. Did some math on it, and it seems very volatile, but at the rate of return that it promises (25-27%), it seems like a no brainer. Even if the market crashes by 50% in 2 years, then recovers back to normal in another 2 years, on an initial investment of 10k, you still come out on top.\n\n  \n10,000 initial investment\n\nYear 1: 2,500 DIV Yield\n\nYear 2: 1,250 DIV Yield (assuming 50% drop across all tech stocks)\n\nYear 3: 1,250 DIV Yield\n\nYear 4: 2,500 DIV Yield\n\n  \nTotal returns of almost 19% per year, even in a recession situation. I understand FEPI sells covered calls against the individual stocks and not against the index, so if the underlying tech stocks crash, it will too, but I'm pretty sure tech stocks will recover eventually through any recession (maybe this is the logic preventing others from doing this?)\n\n  \nI assume there's something wrong with my thinking, or else everyone would be putting 100k into this instead of any other index fund and calling it a day. \n\n  \nCan anyone give me some more info? "
    },
    {
        "Title": "United Health situation",
        "Content": "One thing I see repeated across reddit is that business are evil and stealing all the money.\n I have seen many people happy the United Health CEO got assassinated. I also frequently see people complain about walmart and other corporations. Now I don't care too much this happens, but I wanted to know if I'm missing something.\n\nThe margin for United health is 5%. Most insurance companies have a similar margin. Retailers like Walmart have a margin of 3%.\n\nThis publicly verifiable information seems to contradict the prevailing narrative of corporations price gouging does it not?\nIf United make a profit of $5 for every 100 in premiums it receives, then even if they were a non profit and passed all savings to consumers the price of health care insurance would only go down 5%. In the case of walmart your $100 grocery bill would go down to $97. \n\nAm I missing something or is what I have said accurate?"
    },
    {
        "Title": "Bolivia Signs Major Lithium Deal – Not Great News for Lithium Players",
        "Content": "\n\nBad news—Bolivia has just signed a $1 billion deal with China’s CBC Investments to build two lithium carbonate plants at the Salar de Uyuni. These plants will produce a combined 35,000 metric tons of lithium per year!\n\nBolivia is home to over 21 million metric tons of lithium, mostly found beneath the vast Salar de Uyuni salt flats..It’s actually one of the largest lithium reserves in the world! \n\nWhile this is a big step for Bolivia in becoming a key player in the lithium market, it might not be good news for other lithium players.  More output, driving down lithium price.\n\nticker symbols for the public lithium companies that may be impacted:\n\t•\tAlbemarle Corp: ALB, Lithium Americas Corp: LAC, Rock Tech Lithium Inc: RCK, Arcadium Lithium: ALTM\n"
    },
    {
        "Title": "Meta Announces $10 Billion Data Center in Louisiana",
        "Content": "[https://www.barrons.com/articles/meta-data-center-louisiana-location-2828b80a](https://www.barrons.com/articles/meta-data-center-louisiana-location-2828b80a)\n\nMETA, the parent company of Facebook, is spending $10 billion to build its largest data center ever in Louisiana, the company confirmed on Wednesday.\n\nThe data center will take up 4 million square feet of an industrial site in the northern half of the state that once held a headlight factory.\n\nThe center will be powered by three new natural gas plants with 2.2 gigawatts of combined capacity, according to Entergy, the utility working with the tech giant. That is enough to power more than one million homes. Neal Kirby, an Entergy spokesman, said the plants will also provide power to the surrounding community.\n\n“Entergy raised its earnings growth outlook substantially (solely because of this 1 new customer) and the stock rose 15% on that day,” wrote Rodney Rebello, an analyst covering power stocks at Reaves Asset Management, in an email to *Barron’s*. “It’s a monumental deal for the sector.”\n\nMeta spokeswoman Stacey Yip told *Barron’s* the Louisiana data center “will be significantly larger than our other data center campuses.”\n\nThe company didn’t say how many GPUs the new facility will be able to support. Yip said estimating the future number of GPUs is becoming complex as GPU technology becomes more efficient.\n\nYip also said Meta will invest in 1.5 gigawatts worth of renewable energy, such as solar and wind, to reduce its carbon footprint. All told, Meta will help finance “enough clean and renewable energy to the grid to match the total electricity use of this data center,” she wrote in an email.\n\nBut it isn’t clear when those renewable projects will start. Entergy has filed for permission with the state utilities commission to build the natural gas plants, but not the renewable ones yet, Kirby said.\n\nMeta also said on Tuesday that it is exploring using nuclear energy to power data centers, and asked companies in that field to submit proposals for nuclear reactors. Any reactors wouldn’t be available until well into the 2030s, however.\n\nMeta is investing heavily in artificial intelligence and has been expanding the number of data centers it uses to process its AI applications. But even as the AI race accelerates, this Louisiana data center doesn’t look like it will be completed soon. The company said construction will “continue through 2030 with site work beginning in December.”\n\n"
    },
    {
        "Title": "People are sleeping on Block Inc (SQ)",
        "Content": "I am not going to do a full deep dive here but my main points would be:\n\n1. Business optionality (Square, CashApp, Bitcoin initiatives) - its rare for a company trading at this valuation to have so many possible businesses that could take off.\n2. Forward multiple is very cheap (forward P/E of less than 20).\n3. Healthy balance sheet (net cash of more than $4billion.\n4. High level of insider ownership, and founder guided company.\n5. Consistent revenue growth.\n\nDisclaimer: I am long SQ and bought around \\~$65. I still think it is cheap and may look to add to my position over the next few months."
    },
    {
        "Title": "Shares of American Eagle plunge 13% as company issues weak holiday guidance",
        "Content": "American Eagle issued weak holiday guidance on Wednesday and cut its full-year forecast as it contends with value-seeking consumers who are only willing to spend during key shopping moments. \n\nThe apparel retailer narrowly missed Wall Street’s expectations on the top line, but beat on the bottom line. \n\nHere’s how American Eagle performed during its third fiscal quarter compared with what Wall Street was anticipating, based on a survey of analysts by LSEG:\n\n* **Earnings per share:** 48 cents adjusted vs. 46 cents expected\n* **Revenue:** $1.29 billion vs. $1.30 billion expected\n\nThe company’s reported net income for the three-month period that ended Nov. 2 was $80 million, or 41 cents per share, compared with $96.7 million, or 49 cents per share, a year earlier. Excluding one-time charges related to restructuring and impairment costs, American Eagle posted an adjusted profit of 48 cents per share. \n\nSales dropped to $1.29 billion, down about 1% from $1.3 billion a year earlier. \n\nWhile it was narrow, Wednesday’s miss is the third quarter in a row that American Eagle has not met Wall Street’s sales targets.\n\nShares dropped about 13% in extended trading.\n\nIn a statement, CEO Jay Schottenstein touted a “strong” back-to-school shopping season but said demand remains inconsistent in between major shopping events. \n\n“We have entered the holiday season well positioned, with our leading brands offering high-quality merchandise, great gifts and an outstanding shopping experience across channels,” Schottenstein said. “Key selling periods have seen a positive customer response, yet we remain cognizant of potential choppiness during non-peak periods.” \n\nConsumers coming out for key shopping moments, and then sharply dropping off, has been a consistent theme across the retail industry. Foot Locker cited a similar dynamic when reporting earnings earlier on Wednesday, as did Dollar Tree.\n\nFor its holiday quarter, American Eagle is expecting comparable sales to be up around 1% with total sales down about 4%, including an $85 million impact from having one less selling week and a later start to the holiday shopping season. The outlook is below the 2.2% comparable sales growth StreetAccount was looking for and the 1% sales decline LSEG had expected. \n\nAs a result, American Eagle is now expecting comparable sales to grow by 3% for the full year, down from prior guidance of 4% growth and below StreetAccount’s estimate of 4.1%. It’s now expecting full-year sales to be up 1%, down from previous guidance of between 2% and 3% and below LSEG expectations of 2.5% growth. \n\nSimilar to other retailers, American Eagle had taken a cautious approach to the back half of the year as it contended with uncertainty around the 2024 election and the overall macroeconomic environment. But unlike its competitors, it has kept that cautious tone.\n\nBoth Abercrombie &amp; Fitch and Dick’s Sporting Goods, which issued cautious outlooks earlier this year, reversed their previous mood when reporting earnings earlier this month. \n\nDespite the underwhelming outlook and sales miss, American Eagle is seeing strong demand for its Aerie brand. Third-quarter revenue for Aerie came in at an all-time high for the company and comparable sales grew 5%, on top of 12% growth from the year-ago period.\n\nSource: [https://www.cnbc.com/2024/12/04/american-eagle-aeo-earnings-q3-2024.html](https://www.cnbc.com/2024/12/04/american-eagle-aeo-earnings-q3-2024.html)"
    },
    {
        "Title": "ESPN hopes to reach more casual sports fans with Disney+ integration",
        "Content": "ESPN is coming to Disney+. Now, the sports network wants to make sure Disney+ users come to ESPN.\n\nWalt Disney debuted a dedicated ESPN tile Wednesday on Disney+ for people who subscribe to ESPN+, its sports streaming platform, to watch programming without leaving the Disney+ application. Next fall, when ESPN launches its yet-to-be-named “flagship” service, those subscribers will get full access to all ESPN content through the ESPN tile on Disney+.\n\nDisney is making about 100 live games available to Disney+ members without a corresponding ESPN subscription. Those events will span college football and basketball, the National Basketball Association and WNBA, the National Hockey League, Major League Baseball, tennis, golf, the Little League World Series, and UFC, ESPN Chairman Jimmy Pitaro said in an interview.\n\nNext week’s alternate “Simpsons” telecast of the NFL’s “Monday Night Football” game between the Cincinnati Bengals and Dallas Cowboys will also be available to Disney+ subscribers, as well as five NBA Christmas games.\n\n“Now when you subscribe to Disney+, you’ll have access to kids and family, general entertainment if you’re a Hulu subscriber, and sports,” said Pitaro. “Our goal is to serve sports fans anytime, anywhere.”\n\nESPN will also include some of its studio programming — such as “College Gameday,” “Pardon the Interruption” and certain podcasts that include video — on Disney+ for non-ESPN subscribers. Some ESPN sports-related films and documentaries will also appear on Disney+ married to whatever sports season is active, Pitaro said.\n\nESPN’s programming will also be integrated within the Disney+ search, similar to Hulu’s integration earlier this year. If a Disney+ subscriber who isn’t an ESPN customer clicks on something that requires an ESPN subscription, the user will be prompted to sign up within the app.\n\n# New content for Disney+\n\nESPN is also creating two studio shows specifically for Disney+, Pitaro said. The first will be a daily “SportsCenter” just for Disney+ subscribers, which will air live on Disney+ at a set time and then remain on the platform for on-demand viewing.\n\nThe second is a women’s sports show that may air weekly or several times a week. Both programs are in development and will be made for a more casual sports fan, said Pitaro.\n\n“Our research shows there’s very little overlap between people watching Disney+ and ESPN linear,” said Pitaro.\n\nDisney+ has a strong female audience that Pitaro hopes will tune into the weekly’s women’s show, which he first alluded to in an interview with CNBC Sport in October.\n\nESPN+ has about 30,000 live games each year and costs $11.99 per month when purchased separately from Disney+. A Disney+, Hulu and ESPN+ bundle (with ads) costs $16.99 per month.\n\nSource: [https://www.cnbc.com/2024/12/04/espn-to-add-more-sports-content-to-disney.html](https://www.cnbc.com/2024/12/04/espn-to-add-more-sports-content-to-disney.html)"
    },
    {
        "Title": "Rivians everywhere I look! ",
        "Content": "I know this is anecdotal, and not a good reason to invest, but I have been seeing Rivians everywhere lately. I decided to do a little digging. \n\nRivian's sales were up 71% compared to Q1 2023. The company has been ramping up production, although it has faced some challenges due to supply chain issues. Rivian has adjusted its delivery targets for 2024 to between 50,500 and 52,000 vehicles.\n\nI understand that they have been struggling to make a profit, which definitely cannot be overlooked. But, there is no denying that the demand is there. The backing is also there. Volkswagen has invested in Rivian. In 2024, Volkswagen announced an investment of up to $5 billion in Rivian, with the goal of developing next-generation electric vehicle architecture and software technology. The two companies formed a joint venture to collaborate on this project.\n\nThe stock has been sitting in the 10-15 dollar range the last 6 months. It seems to me that the market is waiting for it to break one way or another. If it breaks to the upside I could see a lot of people that have been waiting on the sidelines hop on board. \n\nThis is just my quick two cents on the stock. Would love to hear everyone’s else’s opinion. I decided to throw 100 dollars on it as a fun bet. I’m definitely routing for them. I think their trucks looks really cool, and I love the new cars in the pipeline. \n\nI’m sure this post will get marked as low effort, but I don’t want to have my post be 5 pages of AI, like every other post. \n\nCheers! Happy investing everyone! "
    },
    {
        "Title": "SCHG vs. SPLG vs. SCHD: Too Much Overlap?",
        "Content": "I’m considering these ETFs for my portfolio: SCHG (growth stocks), SPLG (broad S&amp;P 500), and SCHD (dividend/value focus). I’m worried about overlap—here’s what I’ve found:\n\t\n•\tSCHG vs. SPLG: High overlap (~30%-40%) due to shared large-cap growth names like Apple and Microsoft. SPLG is broader but tech-heavy.\n\t\n•\tSCHG vs. SCHD: Minimal overlap. SCHG is growth-focused, while SCHD avoids most tech in favor of dividend payers like Pepsi and Coke.\n\t\n•\tSPLG vs. SCHD: Moderate overlap; both hold large-cap dividend stocks but differ in sector balance.\n\nWhat’s your take? Worth holding all three, or are two enough?"
    },
    {
        "Title": "Intel’s CEO shakeup puts foundry plans, CHIPS Act cash at risk",
        "Content": "Intel (INTC) is in crisis. The company forced out CEO Pat Gelsinger on Monday, its stock price is down more than 50% on the year, and the grand plan to add third-party semiconductor manufacturing to its repertoire is suddenly more unclear than ever.\n\nGelsinger’s gambit to transform Intel into a US-based version of Taiwan’s TSMC that builds chips for its rivals is one of the reasons the company received $7.8 billion in CHIPS Act funding. But the foundry business, which it plans to operate as an independent subsidiary, has been hemorrhaging money and its biggest customer is still Intel itself.\n\nYes, the company has picked up deals to build chips for Microsoft (MSFT) and Amazon (AMZN), but that hasn’t quelled calls for Intel to kill its third-party foundry plan. Bank of America Global Research analyst Vivek Arya wrote in an investor note that Intel could go as far as fully separating its design and manufacturing businesses.\n\nBut ditching its fabs, or fabrication facilities, is a lot easier said than done, especially if Intel wants to hold on to those CHIPS Act funds.\n\n“They just got the CHIPS Acts money. And if you look very closely at the details, it basically says that Intel cannot sell more than a controlling share of the manufacturing footprint,” explained Mario Morales, group vice president of enabling technologies and semiconductors at IDC. “So that means that Intel will have to maintain manufacturing control of their capacity.”\n\nIn other words, there’s no easy path forward for the US’s largest homegrown chip builder.\n\nThe Commerce Department and Intel announced the chipmaker would be getting CHIPS Act funding just last week, with the DoC saying the cash would help Intel expand its manufacturing capacity in the US, a key part of Gelsinger’s plan to help the company compete with TSMC and Samsung, two of the largest chipmakers in the world.\n\nGelsinger initially unveiled the ambitious agenda, called IDM 2.0, or integrated device manufacturing 2.0, in 2021, the same year he took the reins as CEO. At the time, he said Intel would create a world-class foundry business. But Gelsinger took over an Intel beset by problems.\n\nLack of investment and missed opportunities over the years meant the company failed to catch the mobile wave and fell behind TSMC in design capabilities. And building out a global manufacturing footprint isn’t cheap, which, for a company that was already hurting, wasn’t ideal.\n\nGelsinger had four years to make the turnaround happen, and while Intel’s chip design process is catching up, building chip manufacturing facilities takes time, more than Intel’s board seemed interested in giving Gelsinger.\n\n“Some of the problems that Intel had, and still has, are not things you can solve overnight. They are multiyear issues,” said TECHnalysis founder and chief analyst Bob O’Donnell.\n\n“Gelsinger started on a path to follow some of these things. And I think ultimately, at the highest level, what he chose to do, which is to get the manufacturing stuff back in shape and to work on design, is ultimately what the company needs to do.”\n\nNow Intel has to make a decision: carry on with Gelsinger’s plan or cut back and focus on its own chip building capabilities or give up the business entirely. But doing that means saying goodbye to CHIPS Act money unless it can get approval from the Commerce Department\n\nUnder the terms of the CHIPS Act agreement, Intel is prohibited from certain change of control transactions. If the company spins off its foundry business, it has to hold on to at least 50.1% of the voting rights of the entity if it’s a private company. If the new entity goes public, a third party can’t own 35% or more of it. That means Intel can’t simply cut its foundry business loose and go fabless if it wants to hold on to that CHIPS money.\n\nBut moving forward with the foundry model could be difficult.\n\n“I think as a combined entity it's hard to survive, because the biggest problem is your potential customers for foundry are all your competitors against Intel products,” explained Gartner analyst Gaurav Gupta. “So how would they have trust in Intel foundry and become its customers, right?”\n\nIf Intel does end up pulling back on its third-party manufacturing ambitions, however, it could end up eating a good portion of the losses.\n\n“You'd have to scale back. You'd have to lay off people. I'm sure there would be some sunk cost, but the alternative is you keep losing billions of dollars a quarter,” Citi head of US semiconductor research Chris Danely told Yahoo Finance. “So, I think you just need to scrap it. Take your lumps. If you have to, return the money to the government.”\n\nWhile Danely believes Intel should drop its goal of serving as a global foundry for other companies, he says it should continue to build its own chips.\n\n“I still think they should manufacture their own CPUs,” he explained. \"There's been speculation for a long time that they're just going to turn the keys over to [TSMC] and have [TSMC] make everything. We don't think that that's the right move.”\n\nBefore that, however, Intel needs to find a new permanent CEO.\n\nhttps://finance.yahoo.com/news/intels-ceo-shakeup-puts-foundry-plans-chips-act-cash-at-risk-194227625.html"
    },
    {
        "Title": "Costco's Extreme PE Ratio",
        "Content": "I have been a long time holder and buyer of Costco's stock, my holdings have preformed considerably well compared with the rest of my portfolio. I was buying Costco stock around 2020-2022 when the PE ratio was around 30-40. Since then the PE has shot up and is quickly approaching 60. The last time Costco had a PE this high was right before the 2000's bubble, it lost 50% of its value over the next couple years. Is Costco still worth buying at a 60 PE ratio? Is Costco doing something different with their business model in 2024 that justifies the PE to almost double from the start of 2024? Are investors starting to get irrational in this market? \n\n  \nSincerely, a humble investor\n\n"
    },
    {
        "Title": "How many people invest in leveraged ETFs? Why don’t all bulls do so ?",
        "Content": "Assuming the stock market will remain very strong for years to come would it not make the most sense to buy something like SPXL? Other than a recession what are the disadvantages to something like SPXL ? If a bunch of people sell their SPXL stock what happens ?"
    },
    {
        "Title": "Is Nebius / Yandex a pump and dump or is it going to recover up to prewar prices?",
        "Content": "Nebius (NASDAQ:NBIS) shares surged more than 8% on Tuesday as investment firm Citron Research pounded the table on the artificial intelligence-focused technology firm and said CEO Arkady Volozh is \"the real deal.\"\n\n\"Citron pounding the table that $NBIS is poised to be the next AI Wall Street darling,\" the research firm wrote on the X social network. \"A sleeper with no analyst coverage yet, the market hasn’t caught on to its massive potential—or its undervaluation vs. CoreWeave.\" Shares have gained nearly 35% over the past month.\n\nNebius, which was once known as Yandex before it severed ties with the Russian firm, was likened to cloud service provider Coreweave by Citron, which is likely to go public next year.\n\n\"If it trades at a 50% discount to Coreweave multiple that puts $NBIS at $60 (napkin math),\" Citron added, explaining that Nvidia's (NVDA) investment into Nebius was \"not out of the blue.\"\n\nOn Monday, Nvidia was among the backers in a $700M private placement financing round by Nebius. Other investors include Accel and certain accounts managed by Orbis Investments. The financing will help Nebius' plans to further build out its full-stack AI infrastructure."
    },
    {
        "Title": "Do you guys believe we are in the beginning of “the great melt up” or that a recession is coming in the somewhat near future ?",
        "Content": "While there are some signs pointing to a recession in the not so distant future such as the inversion and now re steepening of the yield curve and the sahm rule triggering as well as P/E ratios which are incredibly high. There is also the argument that the government cannot afford a recession at the moment and will not allow one to occur, we are in too much debt and cannot afford these high interest payments meaning that the government will chat interest rates again and spend as much as it needs to to avoid a recession causing hyperinflation and a “great melt up” in all assets, instead of an everything bubble it will be come an everything mega bubble which will last until the end of the decade. I see arguments for both sides and think they both make sense. On one hand government spending is so high and they will keep it that way to avoid a recession, on the other hand this isn’t the first time we’ve had very elevated levels of government spending and they have not been able to prevent a recession in the past and that the indicators I listed earlier have a pretty high accuracy rate. What do you guys think? "
    },
    {
        "Title": "These are the stocks on my watchlist (12/4)",
        "Content": "Hi! I am an ex-prop shop equity trader.\n\nThis is a daily watchlist for trading: I might trade all/none of the stocks listed, and even stocks not listed! I only hold some/all MAG 7 stocks and market indices long-term. If you use Old Reddit, click “Show Images” at the top to expand the charts. Any positions stated aren’t recommendations, I’m following subreddit rules to disclose positions. I use IBKR TWS for my platform and charts.\n\nI am targeting potentially good candidates to day trade; I have no opinion on them as investments. This means the potential of the stock moving today is what makes it interesting, not the business, long-term prospects, or the people involved.\n\nPLEASE ask specific questions and PLEASE don’t ask about earnings because I typically don’t take positions before earnings announcements. Questions like “Thoughts on \\_\\_\\_\\_\\_?” or “Why isn’t \\_\\_\\_ on the watchlist?” or something answered already will be ignored unless you add detail and your opinion.  If you post a question and delete it after I answer it, I will block you- doing that hurts discussion. I am not answering questions if I’m still long or short a stock beyond what I update.\n\nNews: [South Korea Opposition Party Seeks To Impeach Yoon For Treason](https://www.bloomberg.com/news/articles/2024-12-04/south-korea-opposition-party-seeks-to-impeach-yoon-for-treason-m49amyj3)\n\n[**CPNG**](https://finviz.com/quote.ashx?t=CPNG&amp;p=d) \\- Watching the situation in South Korea still, currently long.\n\n[**FL**](https://finviz.com/quote.ashx?t=FL&amp;p=d) \\- Shares fall due to weak consume demand and steep promotions across sneaker marketplace. EPS of .33 vs .41 expected, revenue of $1.96B vs $2.01B expected.\n\n[PLTR](https://finviz.com/quote.ashx?t=PLTR&amp;p=d) \\- (Yesterday's news) Achieved new government security designation, sending stock to ATH. Watching $75 level, but biased short. No position.\n\n[**OKTA**](https://finviz.com/quote.ashx?t=OKTA&amp;p=d) \\- EPS of .67 vs .58 expected, revenue of $665M vs $650M exp. Success attributed due to investments made in partner ecosystem and public sector vertical.\n\n[**MP**](https://finviz.com/quote.ashx?t=MP&amp;p=d) \\- (Yesterday's news) Moving off of China's ban of key minerals to the US, still worth watching.\n\nEarnings: [**S**](https://finviz.com/quote.ashx?t=S&amp;p=d), [**AEO**](https://finviz.com/quote.ashx?t=AEO&amp;p=d)"
    },
    {
        "Title": "Amazon sued by DC attorney general for allegedly excluding neighborhoods from Prime delivery",
        "Content": "Washington, D.C.’s attorney general sued Amazon on Wednesday, accusing the company of covertly depriving residents in certain ZIP codes in the nation’s capital from access to Prime’s high-speed delivery.\n\nThe lawsuit from AG Brian Schwalb alleges that, since 2022, Amazon has “secretly excluded” two “historically underserved” D.C. ZIP codes from its expedited delivery service while charging Prime members living there the full subscription price. Amazon’s Prime membership program costs $139 a year and includes perks like two-day shipping and access to streaming content.\n\n“Amazon is charging tens of thousands of hard-working Ward 7 and 8 residents for an expedited delivery service it promises but does not provide,” Schwalb said in a statement. “While Amazon has every right to make operational changes, it cannot covertly decide that a dollar in one zip code is worth less than a dollar in another.”\n\nIn June 2022, Amazon allegedly stopped using its own delivery trucks to shuttle packages in the ZIP codes 20019 and 20020 based on concerns over driver safety, the suit states. In place of its in-house delivery network, the company relied on outside carriers like UPS and the U.S. Postal Service to make deliveries, according to the complaint, which was filed in D.C. Superior Court.\n\nThe decision caused residents in those ZIP codes to experience “significantly longer delivery times than their neighbors in other District ZIP codes, despite paying the exact same membership price for Prime,” the lawsuit says.\n\nData from the AG shows that before Amazon instituted the change, more than 72% of Prime packages in the two ZIP codes were delivered within two days of checkout. That number dropped to as low as 24% following the move, while two-day delivery rates across the district increased to 74%.\n\nAmazon has faced prior complaints of disparities in its Prime program. In 2016, the company said it would expand access to same-day delivery in cities including Atlanta, Chicago, Dallas and Washington, after a Bloomberg investigation found Black residents were “about half as likely” to be eligible for same-day delivery as white residents.\n\nThe ZIP codes in Schwalb’s complaint are in areas with large Black populations, according to 2022 Census data based on its American Community Survey.\n\nThe Federal Trade Commission also sued Amazon in June 2023, accusing the company of tricking consumers into signing up for Prime and “sabotaging” their attempts to cancel by employing so-called dark patterns, or deceptive design tactics meant to steer users toward a specific choice. Amazon said the complaint was “false on the facts and the law.” The case is set to go to trial in June 2025.\n\nAccording to Scwalb’s complaint, Amazon never communicated the delivery exclusion to Prime members in the area. When consumers in the affected ZIP codes complained to Amazon about slower delivery speeds, the company said it was due to circumstances outside its control, the suit says.\n\nThe lawsuit accuses Amazon of violating the district’s consumer protection laws. It also asks the court to “put an end to Amazon’s deceptive conduct,” as well as for damages and penalties.\n\nTo get packages to customers’ doorsteps, Amazon uses a combination of its own contracted delivery companies, usually distinguishable by Amazon-branded cargo vans, as well as carriers like USPS, UPS and FedEx, and a network of gig workers who make deliveries from their own vehicles as part of its Flex program.\n\nAmazon has rapidly expanded its in-house logistics army in recent years as it looks to speed up deliveries from two days to one day or even a few hours. In July, the company said it recorded its “fastest Prime delivery speeds ever” in the first half of the year, delivering more than 5 billion items within a day.\n\nIn relying on its own workforce, Amazon has assumed greater control over its delivery operations.\n\nIn his complaint, Schwalb cites an internal company policy that says Amazon may choose to exclude certain areas from being served by its in-house delivery network if a driver experiences “violence, intimidation or harassment.” The company relies on UPS or USPS to deliver packages in excluded areas.\n\nSource: [https://www.cnbc.com/2024/12/04/amazon-sued-by-dc-ag-over-excluding-areas-from-prime-delivery.html](https://www.cnbc.com/2024/12/04/amazon-sued-by-dc-ag-over-excluding-areas-from-prime-delivery.html)"
    },
    {
        "Title": "GM expects more than $5 billion impact from China restructuring, including plant closures",
        "Content": "General Motors expects a restructuring of its joint venture operations with SAIC Motor Corp. in China to cost more than $5 billion in non-cash charges and writedowns, the Detroit automaker disclosed in a federal filing Wednesday morning.\n\nGM said it expects to write down the value of its joint-venture operations in China by between $2.6 billion and $2.9 billion. It also anticipates another $2.7 billion in charges to restructure the business, including “plant closures and portfolio optimization,” according to the filing.\n\nGM, which previously announced plans to restructure the operations in China, did not disclose any additional details about the expected closures.\n\n“As we have consistently said, we are focused on capital efficiency and cost discipline and have been working with SGM to turn around the business in China in order to be sustainable and profitable in the market. We are close to finalizing our restructuring plan with our partner, and we expect our results in China in 2025 to show year-over-year improvement,” GM said in an emailed statement.\n\nGM said it believes the joint venture “has the ability to restructure without new cash investments” from the American automaker.\n\nA majority of the restructuring costs is expected to be recognized as non-cash, special item charges during the fourth quarter. That means they will impact the automaker’s net income, but not its adjusted earnings before interest and taxes – a key metric monitored by Wall Street.\n\nGM’s operations in China have shifted from a profit engine to liability in the past decade as competition grows from government-backed domestic automakers fueled by nationalism, and as a generational shift in consumer perceptions of the automotive industry and electric vehicles takes hold.\n\nEquity income from GM’s Chinese operations and joint ventures peaked at more than $2 billion in 2014 and 2015.\n\nGM’s market share in China, including its joint ventures, has plummeted from roughly 15% as recently as 2015 to 8.6% last year — the first time it has dropped below 9% since 2003. GM’s equity income from the operations have also fallen, down 78.5% since peaking in 2014, according to regulatory filings.\n\nGM’s U.S.-based brands such as Buick and Chevrolet have seen sales drop more than its joint venture sales with SAIC Motor, Wuling Motors and others. The joint venture models accounted for about 60% of its 2.1 million vehicles sold last year in China.\n\nPrior to this year, the only quarterly losses for GM in China since 2009 were a $167 million shortfall during the first quarter of 2020 due to the coronavirus pandemic and an $87 million loss during the second quarter of 2022.\n\nThe Detroit automaker has reported three consecutive quarterly losses in equity income for its Chinese operations this year, totaling $347 million. That includes a loss of $137 million during the third quarter.\n\nSource: [https://www.cnbc.com/2024/12/04/gms-expects-more-than-5-billion-impact-from-china-restructuring-including-plant-closures.html](https://www.cnbc.com/2024/12/04/gms-expects-more-than-5-billion-impact-from-china-restructuring-including-plant-closures.html)"
    },
    {
        "Title": "Whats going on with the french index?",
        "Content": "Let's talk about the french CAC 40 index.\n \nIn a few hours, barnier's government will collapse as a no confidence motion has been put forward. \n\nAs such the budget he passed using article 49.3 will be rejected, france will fall in further political chaos as far left and far right will fight for the government and france's deficit of 6.1% of gdp will grow larger. \n\nAlso note the french economy contracted severely last month as pmi data showed clearly.\n\n\nWhat's the market reaction this terrible news? 4 days of consecutive gains and today its 0.50% higher as well. \n\nWhats the reasoning here? Am I not getting something? \n\nThe german index is another wonder as well, germany has been effectively in recession for 2 years but its doing ATH. \n\n"
    },
    {
        "Title": "Banxa Holdings Inc. $BNXA",
        "Content": "$Banxa Holdings Inc (BNXA.CA)$ (on the TSX-V)\nBanxa has just had their first ever breakeven quarter. We will likely see their first ever profitable quarter in a few months with the current crypto climate. \n\nBanxa fair value is probably around $4.00 a share but with the hype I can see it going to $8.00 again by Spring 2025. \n\nBanxa is an crypto on-ramping business. Think it like a baby Coinbase. \n\nLast crypto cycle 4 years ago Banxa hit $8.30. Since then there has been next to no dilution and most shares are held by insiders. \n\nThere could be very significant profit to be made in just the next few months here. Good luck and do your own due diligence.\n\nLet me know if you have any questions. I have been trading and following Banxa Holdings since they first went public in January 2021. "
    },
    {
        "Title": "Put everything I have outside of retirement on mortgage?",
        "Content": "For the last near decade I’ve lived a very modest life. Spending very little money on any pleasure. I’ve lived with family and saved essentially everything and have amassed $200k in a HYSA and another $150k invested in a taxable brokerage account, on top of my retirement funding. Capital gains in the taxable are only around $25k, as I recently started non retirement investing, so a lot of that is principle.\n\nRecently bought a $500k home with a 7% mortgage. I put $100k down to avoid PMI, taking my cash level down to $100k from $200k\n\nI’m wondering if I should drop my cash reserves down to $25k as my emergency fund, and liquidate everything in my taxable and put $225,000 on my $400,000 mortgage, which will leave me with $175,000 left owed and $25,000 remaining outside of retirement. \n\nI can save $30-40k a year, so that means in order to pay off the mortgage, for the next 5 years I’d have to put every additional dollar I have on the house on top of this liquidation and keeping my funds down at the bare bones $25k level. In 5 years I would essentially have a paid for $500k house and $25k in cash to my name - this all is if I don’t get married and “life happens”. Anything outside of this dedicated plan would add more years to payoff. \n\nOn the other hand, I could keep the $150,000 growing in the markets and keep investing as I have been before taking on this mortgage - And then refinance my loan at a later date.\nTechnically right now I could have close to $225k invested if I chose to invest everything down to that $25k level instead of using it for the mortgage. \n\nI am having trouble deciding on what to do"
    },
    {
        "Title": "Does this time remind you of the dot-com era?",
        "Content": "Man, I have to say living through that time in the late 90's where everyone and their grandmother were giving you tech stock advice was a surreal time. I was new to the industry, but it was hitting this fever pitch where hard working everyday folks were moving all of their hard earned life savings into 100% dot com stocks - just dreaming to strike it rich like all their friends. I could only imagine the conversations that followed with their loved ones, when the entire market dropped out from under them. I wanted so much to say \"I told you so\" ... but was honestly too heartbroken for them.\n\nFast forward to today. Even with Bitcoin/Crypto's use case being very compelling ... I can't help but to get flash backs of the dot-com era. This euphoria has occurred before, and I hate to think that history will repeat itself again (which it more than likely would, as I'm hearing people talk and act the same way).\n\nThere's no question these are exciting times, but can't help but to have PTSD ... with visions of people losing the shirt off their backs. Anyone else lived through that time and feel the same way?"
    },
    {
        "Title": "Am I entering in the stop limit correctly?",
        "Content": "I'm currently investing in a crypto in which my average buy in cost was 1.94. I want to create a stop limit that sells all of my shares if the price falls below 2.10. I see 3 different categories on coinbase when trying to execute this order. Stop price, limit price and amount. Is stop price and limit price the same thing? Would I put 2.1 in both of those categories? Coinbase also wants to charge me a fee for this transaction. However I will not pay the fee unless the transaction goes through, right? I also see limit and stop limit under order type. What is the difference between these 2 categories?"
    },
    {
        "Title": "I want to start investing ",
        "Content": "I’m 15 and I wanna buy stock or crypto, I saw that Reddit keeps going higher and higher by the day and I put $20 in it. I remember about 2-3 years ago I saw people preaching the hell out of XRP and now it’s huge, I was just wondering if you guys had any tips for me since I don’t know much yet "
    },
    {
        "Title": "PSA: PE Ratios Don’t matter - You’re missing out on gains!",
        "Content": "PE ratios are just numbers. That’s it—they don’t inherently mean anything.\n\nLook at companies like TSLA, NVDA, WMT, and COST. These are market leaders in their respective sectors with massive competitive moats. These companies are built to weather almost any economic environment and are likely to be around for decades. Betting against them based on valuation metrics like PE ratios is shortsighted.\n\nPeople who avoided investing in Amazon, Walmart, or Google in their earlier years because of “high valuations” missed out on generational wealth-building opportunities. History shows that great companies often earn their high valuations by continuing to dominate and expand.\n\nAnd before someone inevitably brings up Enron or other frauds—those are completely different scenarios. Those collapses were driven by accounting scandals and a lack of actual business fundamentals. TSLA, NVDA, and others are the opposite: they have solid growth prospects, cutting-edge innovation, and established track records.\n\nInstead of obsessing over traditional valuation metrics, focus on the quality of the business, its leadership, and its long-term potential. Don’t let PE ratios scare you away from companies that could define the future."
    },
    {
        "Title": "I put a lot more funds into my regular brokerage than my Roth IRA. How unwise is this?",
        "Content": "I like the idea of being able to access my money before 59 without penalty so it makes more sense to me to invest mostly in a regular brokerage, is this a bad idea? \n\nI hear often that you should max your Roth IRA first, then contribute whatever is left into your other accounts, but I still don’t fully get why I would do that if I want to access those funds before 59. Appreciate any responses"
    },
    {
        "Title": "Does Gen Z invest in stocks or cryptos?",
        "Content": "What I am asking is whether there is a chance for cryptocurrencies to replace stocks as the primary investment for the next generation, and what the implications are for those of us who primarily invest in the stock market. Does the intrinsic value of a stock matter if there is no demand to drive the price up?"
    },
    {
        "Title": "Wild Investigation of Finfluencer Sponsors by The Plain Bagel",
        "Content": "This investigation by The Plain Bagel is pretty wild. He collected sponsorship data from a bunch of finance influencers and looked into the price return of these companies. What he reported is pretty crazy. For example, the majority of them reported no sales for the last 12 months. Check the full video [here](https://www.youtube.com/watch?v=-Q3g-6jFl2c). "
    },
    {
        "Title": "What is this 4% rule everyone is talking about?",
        "Content": "I am having difficulty understanding what it exactly means. I heard 3 different things.\n\n1: you can withdraw 4% of your money and it will remain the same amount. Example: you pull out 4% of 1mil and you still have 1 mil.\n\n2: you can withdraw 4% of your money and it will probably go up AND you get that 4%\n\n3: you can withdraw 4% of your money and HOPEFULLY you don't run out.\n\nSo, which is it? And where is this magical 4% coming from??"
    },
    {
        "Title": "My parents invest with a hedge fund. I think they are doing worse than the S&amp;P. What do I need to confirm this?",
        "Content": "I know next nothing about investing except that the purpose of having someone invest for you is that they outperform the S&amp;P 500 and they do so after whatever fees they take.  What information do I need to look at it confirm how they are doing vs the S&amp;P 500.  They have been investing with this fund for about 12 years now"
    },
    {
        "Title": "Starting from ground 0 and all of this is quite overwhelming.",
        "Content": "I’m 35 years old and have no hopes of financial freedom before I die, I will work until my heart stops ticking.\n\nCovid completely wiped me out, I work in the hospitality field, have very little bills, and almost no debt.\n\nI just accepted a job offer that will provide stability but they don’t offer 401k and I doubt I could max out a Roth IRA.\n\nWhat does my generation do, what can I do to even feel like I’m not wasting my time, trying to get ahead of something that is impossible?\n\nIm all ears because investing is interesting to me.\n\nTake care and have a good night 🫡 "
    },
    {
        "Title": "New to trading, need some advice for future investment.",
        "Content": "Hey folks! As the title reads i''m relatively new to trading and could need some advice for future investment. No risky stuff, just some stocks who generated more rendit than putting it in a bankaccount.\n\nSo far i took amzn, which worked quite well so far, i'm gonna keep it till the retours after christmas, i guess.\n\nThe stock which made me interested in trading even more was RHM, (Rheinmetall) which is a big employer in my area. \n\nThought it be a bank like a month ago (since the conflict in UA is ongoing). I started like two weeks ago, buying and holding this share.\n\nThey now announced to built an ammunition plant in Lithuiania like two days ago and i could sell with 120 € plus on my 2.5k investment. \n\nSeems to easy. When do i sell?\n\nKind regards from Germany."
    },
    {
        "Title": "Thoughts on public-facing private markets strategies?",
        "Content": "Ive recently come across various private markets investing platforms that apparently allow \"normal\" people to invest in PE, Private Credit, and similar things. From what ive seen, there are various companies that offer different products:\n\n1. Arta Finance - minimum 10k investment, it seems that its like actually investing in a specific fund at KKR or similar, just at a lower price point and with more people\n2. Yieldstreet - seems to offer a mix portfolio of private investments oriented around growth or income, basically crafting a guided investment platform with privates\n3. Goldman Sachs / JPM / other banks- seem to offer evergreen private markets funds that work the same as a mutual fund with low minimums, but some minimums are still 50k+\n\nHas anyone used any of these? Any good low-minimum options for private investing outside of micro lending or crowdsource investment platforms?"
    },
    {
        "Title": "Which ETF would be best for me to start with? VOO, SPY, or VTI?",
        "Content": "I am finally beginning to take my retirement seriously even if it may be a bit late.\nI do have a company pension. Apart from that I have never opened a Roth or a HYSA.  I do also have about 53 k in a teacher retirement account from a previous careers/org.  I can comfortably buy a share of VTI once per month, maybe SPY if I really commit.\nAlso I am thinking of moving my bank savings into a brokerage account where it at least gains 4.75 APY.  \nMy other thoughts are rolling the teacher retirement into a Roth, either one as I see my income going down to say less than current tax bracket it’s on. \nJust wanted to get some thoughts, I know it’s a lot. TIA"
    },
    {
        "Title": "HSA Investing Question - Plz Help",
        "Content": "Hello! I work for a credit union in the Midwest. I contribute to my 401(k) and HSA. They opened up an HSA checking account along with my normal checking &amp; savings account. They put my contributions in the HSA checking account but I was wondering if I can open up a fidelity account to invest my HSA funds. Is this allowed? "
    },
    {
        "Title": "17 year old looking for some long term investment ideas",
        "Content": "This is not my first rodeo with the stock market, I've been trading since 2020 (13), and the only two major long term investments that I have is Apple and VTI, both serving me greatly. I would consider Rivian to also be a long term stock, but it is more risky than the other two. My portfolio mainly consists of Tech stocks as for it is a market I am actively participating in and informed about, but I'm open to broadening markets. \n\nI was either planning on dumping more money into VTI, however as it reached $300 It became a bit too expensive for me to want to invest more in. Something I'm more concerned about is a crash, especially in the tech market as for it is reaching all time highs, but from what the tech market has shown in the past decade, is UP with some downs obviously. I know VOO and other vanguard ETF's are shown to do really well, but most of them are expensive, but in the end it may just be worth it. "
    },
    {
        "Title": "Need Advice for Investing Funds Moved to a 401K Rollover",
        "Content": "I recently initiated roll over of more than $200K from my previous employer's 401K into a 401K rollover account. I’m planning to invest heavily in some index funds, like VOO, along with some individual stocks. The market is very hot right now, so I’m trying to determine the best strategy for timing the investment in index funds. While I know you can’t time the market, should I wait for a dip (it feels like one could happen within the month) before putting money in the index fund? Or should I set up incremental buy orders over the next couple of months to dollar-cost average? Of course, there’s always the risk the market keeps climbing, and by waiting, I’d miss out on potential returns.\n\nOn top of that, it’s frustrating to still be waiting for the check to deposit—I feel like I’ve already missed out on this past week’s rally. Any thoughts on the best approach?"
    },
    {
        "Title": "Seeking Advice: Stock Sale or Margin Loan/HELOC for Home Renovation",
        "Content": "Live in Bay Area and we bought a house in 2020 (locked in a 3%). Thankfully our mortgage was affordable for us but last year's promotion meant going to fixed salary and no longer receiving company's overtime pay. Promotion meant my \"salary\" went up $20k but no longer getting OT meant actually taking a $50k cut. (120k went to 140k but actual take home was 190k now down to 140k).  \nSalaried positions get RSUs which help offset pay loss and, in a few years, my pay increases should start to bring me back up to last year's take-home. Basically we're now in the \"house-poor\" group. We're thankful for our situation but understandably this requires a lot of budgeting.\n\nWith that background here's our situation:  \nWe really want to remodel our house. For what we want to do I'm estimating $150k budget (kitchen, bathrooms, interior, exterior, adding doors, moving windows, floors, etc...). Our neighbor recently did a similar remodel for $75k but I think he had a connection with a few contractors. I don't have final quotes yet and our budget will help us determine what is a priority. \n\nI could pay for all of this if I sold some company stock but, this stock traditionally does really well and last 5years saw a 200+% return.  So if I sell this stock then I'm missing out on future potential returns, essentially making this remodel perpetually more expensive. \n\nAlternative is something like a Margin Loan or a HELOC. I'd be able to fulfill our reno budget with a margin loan and keep our LTV pretty low.   \nThe problem with taking a loan (like HELOC) is that we would need to sell stock to make the payments. If we're using the stock as leverage for a loan then selling stock to pay the loan, is that any better than just selling stock to buy what we need? The only benefit I could see is feathering the stock sales over time to leverage as much gains as possible, compared to selling it all now.\n\nHaving contractors coming in soon to start quotes and give timelines. I'll need to have a finance plan in place soon.   \nThanks.\n\nTLDR: house poor but need renovations. Asking if we pay for work with stock sale or take out loan and slowly pay loan via selling stocks? "
    },
    {
        "Title": "What is the science behind item 1a in 10-k filings?",
        "Content": "As per tittle, i struggle to understand and compare item 1a in 10-k filings.\n\n  \nWhile it generally deals with risks, there seem to be little standardization in how it is presented and how companies assess their risk. for instance, Goldman Sachs does not even mention human capital as a risk factor, unlike, say J&amp;J, and Chevron is very generic on their supply chain risks\n\ni have not found very specific guidance either.\n\n  \nJust, which rules should companies follow how when writing it, and how can i analyze similar risks across different investing opportunities? any good resource on this niche topic?\n\n  \nThanks"
    },
    {
        "Title": "Index universal life insurance",
        "Content": "Not sure if this post belongs in this subreddit, but worth a shot…\n\nLooking for advice if anyone would recommend establishing an index universal life insurance policy for my 3 kids. It seems appealing, and low risk, but what am I missing? \n\nThank you!"
    },
    {
        "Title": "Thoughts on this investment plan for the next 20 years?",
        "Content": "I am 24 years old, I turn 25 next year. I currently have around 120k 401k and Roth IRA. I want to start a Taxable Brokerage sort of like a retire early fund that can carry me into the age to begin taking contributions from my retirement accounts, and I want to possibly start a business with this money in the future. This is like a 20-30 year plan. Are these stocks and EFT’s a good place to start? What should I take away, replace, or add more of to?\n\nVOO - 30% of Portfolio \nVTI - 25% of Portfolio \nSCHF - 15% of Portfolio \nAMZN - 10% of Portfolio \nGOOGL - 10% of Portfolio \nNVDA - 5% of Portfolio \nTSLA - 5% of Portfolio "
    },
    {
        "Title": "Rethinking Emergency Fund",
        "Content": "Many recommend you keep 3-12 months of expenses in cash in case of emergency. So lets suppose its 9 months at $5000 a month.\n\nThat is $45k emergency fund. The S&amp;P500 return 28% this year. You basically lost $13,800 because you held it in cash.\n\nDoes it really makes sense to hold 12 months of expenses? Instead why would you not just buy an index like VOO in a taxable account. If you do need quick cash you can sell VOO.\n\nSure there are times you might have bad timing. But the market is up much more often than down.\n\nI have been keeping an emergency fund for years. And so far I never had to tap much into it. I must have lost tens of thousands of lost returns. \n\nI think I will switch to a 1 month of expenses cash reserve. If I need more cash I will strategically sell stocks/etf in my taxable account (tax gain or loss harvesting)"
    },
    {
        "Title": "Just crossed 100% return on my company's employee stock plan. What to do?",
        "Content": "My employee stock purchase plan shares just crossed a total return of 102%. My plan has always been to sell all of the long shares once that happened but when it happened today, I faced a conundrum: What do I put it into once I sell it?\n\nI have all the rest of my brokerage account in IVV. So I thought of just dropping the sale of my long shares into IVV, as I currently own no individual stocks and am really hesitant to do so, just because it's an unfamiliar thing for me.\n\nAny suggestions for what I should invest the returns in? Keep it in IVV? Put it into something like SCHD? Divide it up between the two? Start buying individual company stocks? Which ones?\n\nI'm 40, no kids, not married, own my home (not outright, at 3.05%) and a vacation home (also not outright, at 7.5%, and that I plan to rent out on occasion once winter in the PNW passes.) Still have some student loans (3.5%) and car payment (3.25%). No credit card debt. All those rates to me suggest investing all the returns. But maybe I'm wrong?\n\nThanks, everyone!"
    },
    {
        "Title": "How can someone learn and be better at options ",
        "Content": "HowI just now started trading a couple months ago I bought about 10k worth of shares in Nvidia and it doing me very well. But I have been trying to learn options and in this month alone I’m down $5000. I try to use paper money but I think that didn’t help because I had no emotions in it. What do you guys do to get better at trading options because I’m struggling, but I do want to get better at this so I can make extra money. I do think my main problem is to get rich quickly and I’m doing very short strike prices with almost no time for it to develop. Would you guys recommend to pick longer exp? "
    },
    {
        "Title": "Powell says he’s not worried about the Fed losing its independence under Trump",
        "Content": "Powell says he’s not worried about the Fed losing its independence under Trump"
    },
    {
        "Title": "With a 1% inverse yield curve everything seems on track for an end-January rug pull.",
        "Content": "How will you degenerates prepare?"
    },
    {
        "Title": "DD: Canaan (CAN) buy the company that sells the top miners to  companies like MARA and CLSK",
        "Content": "Canaan (CAN): The Bitcoin Gold Rush Pickaxe Play 💎⛏️\n\nIn the 19th-century gold rush, the real winners were the ones selling tools—picks, shovels, and axes. Today, in the digital gold rush of Bitcoin, Canaan Inc. (CAN) plays a similar role, providing the essential hardware that powers cryptocurrency mining operations worldwide.\n\nThe Hashrate Arms Race\n\nPublicly traded Bitcoin mining companies are scaling up their operations to increase hashrate—the computational power used to mine Bitcoin and process transactions. This race is driven by the need to secure more mining rewards and maintain profitability as mining difficulty rises.\n\nCanaan is uniquely positioned to profit from this expansion as mining companies continue to demand high-performance hardware for their growing operations.\n\nRecent Industry Expansions and Acquisitions\n\n\t•\tMarathon Digital Holdings: Acquired two operational Bitcoin mining sites in December 2023, totaling 390 megawatts of capacity, for $178.6 million.\n\t•\tCleanSpark Inc.: In October 2024, acquired GRIID Infrastructure Inc., significantly expanding its mining capacity in Tennessee.\n\t•\tRiot Platforms: Acquired Block Mining in July 2024, boosting its total power capacity to 2 gigawatts.\n\nThese expansions highlight the growing demand for efficient and cost-effective mining hardware—a market Canaan serves directly.\n\nCanaan’s Strategic Position\n\nCanaan’s AvalonMiner series is designed to meet the needs of both large-scale and smaller mining operations. Here’s how it compares to key competitors:\n\n\t•\tAvalonMiner A1246: 90 TH/s hash rate with 38 J/TH efficiency.\n\n\t•\tBitmain Antminer S19 Pro: 110 TH/s with 30 J/TH efficiency.\n\n\t•\tMicroBT Whatsminer M30S++: 112 TH/s with 31 J/TH efficiency.\n\nWhile competitors lead in raw performance, Canaan’s hardware offers strong value through competitive pricing and accessibility. This balance positions Canaan as a key player in the mining hardware supply chain, particularly for cost-conscious operations.\n\nRecent Bullish Developments\n\nCanaan has also secured large purchase agreements from major mining companies:\n\n\t•\tHIVE Digital Technologies: Ordered 5,000 Avalon A15-194T miners (194 TH/s each) after a previous order for 6,500 Avalon A1566 miners.\n\n\t•\tCipher Mining Technologies: Purchased 6,600 Avalon A1566 miners earlier in 2024.\n\n\t•\tThe recent order of 3,800 Avalon A1566I Immersion Cooling Miners from CleanSpark underscores the growing demand for Canaan's cutting-edge technology. This large-scale adoption by industry players signals a vote of confidence in Canaan's ability to meet the evolving needs of the mining sector\n\nThese deals highlight the demand for Canaan’s hardware and its ability to cater to large-scale operations.\n\nConclusion\n\nIn the escalating competition among Bitcoin miners, Canaan profits as the supplier of essential hardware. As mining companies expand through acquisitions and infrastructure development, Canaan’s position as a key provider makes it well-suited to capitalize on the industry’s growth.\n\nTL;DR: Canaan isn’t mining Bitcoin—they’re selling the tools miners need. As the mining industry grows, so do Canaan’s opportunities. Miners compete, Canaan profits. NFA."
    },
    {
        "Title": "Dicky PDD DD",
        "Content": "PDD DD\n\nThis is a sure thing\n\n[Dumped my entire TFSA into PDD yesterday](https://i.imgur.com/ileUaxN.png)\n\nAs a guy in his 20s, this TFSA is (basically) all I got. Spent years building this account. I tossed everything in there.\n\n###DD\n\nAm pure-blooded Chinese. Grew up in canada. Moved back to China last year.\n\nMany of you ass clowns subscribe to the concept that Chinese have small dicks. Honestly that’s cool, but if you subscribe to that, then you must also subscribe to the fact that chinese have high IQs\n\nPDD has about 14k employees. It is amongst the elite of the elite companies to work at, especially for fresh chinese college grads. China has 1.4 billion people.\n\nImagine a high IQ country of 1.4 billion people, now imagine 14k of the highest IQ people out of those 1.4 billion high IQ people working at a single company, and you got PDD.\n\n###China’s 996 work culture\n\n996 means 9am - 9pm, 6 days a week. Basically a 70-hour work week. It’s extremely toxic, but undoubtedly the most competitive work model in the world.\n\nImagine a company of people with average IQ of 135, all working 70 hours a week. Imagine the competitiveness of such an organization.\n\nTemu’s tremendous growth is no surprise. Temu is the fastest growth e-commerce marketplace for a good fucking reason. Like I mentioned, it’s built by an organization with an average IQ of 135, with basically everyone no life working 70 hour weeks.\n\n###Personal experience:\n\n- So far in China I dated 2 girls working from PDD. One worked in HR and one worked in product. They were horribly unattractive. Why? They dunno how to use makeup, they dunno how to dress. They only know how to work. The HR girl especially, told me just how many interviews they’re doing. They’re growing FAST. Their work pace is literally incomprehensible for clueless westerners. I’d wager most US tech workers would probably have a mental breakdown if they work 1 month at PDD, because they simply can’t handle its pace and the stress.\n- After moving back to china, I first started buying shit off jd.com and taobao because I haven’t heard of PDD. Then one day I started using PDD, and from that day onwards, 80% of my online purchases are from PDD. It’s simply the best shopping app in China for most items. That’s all you need to know.\n\nThe biggest counter-argument is… “But it’s a chinese company! They’re cooking the books”\n\n- Just because 1 chinese company cooked the books, doesn’t mean every chinese company is cooking the books, dumbass.\n- Chinese companies live in fear of being delisted due to the bad reputation that chinese companies have. Do you really think they’re dumb enough to cook the books when they got a target on their back? If you got a target pointed at your back, you play it safe, dumbass.\n- That 1 chinese company known for cooking its books? Well, if you bought its stock at the bottom, you would have 15x’ed your money, dumbass\n\nPDD is a long term hold for me, although I might consider selling if it hits ~$200 USD (2x my book value) in a short timeframe and look at other options.\n\n###This is a sure thing.\n\n###Trust me on this one.\n\nP.S. Most of you dumbasses are too dumb to realize that China’s stock market today is like US’s stock market in the 70s. Buffett’s success cannot be replicated today in the US market, but it can be replicated in the chinese market. There are so many undervalued stocks in the Chinese stock market today due to the intense fear investors have for the Chinese stock market, both from domestic chinese investors and international. There are so many opportunities in the chinese stock market today, but most of you watch too much western propaganda and don’t have enough brain cells to think anything else except “CHINA BAD”, “CANT TRUST NO CHINESE COMPANY”, “THEY BE COOKING THE BOOKS AND SHIT YO”, “CHINESE BE COMMUNIST AND SHIT BRO LOL”"
    },
    {
        "Title": "The Future of Tesla",
        "Content": "The biggest pump and dump of all time. \n\nTesla.\n\nAsk yourself this, why did Bill Gates (as of July 4, 2024) have a $2 Billion short position against one of the most wildly popular meme stocks of all time? I can think a billion better ways to spend that money. That short was meant to make a statement, as it is nearly negligible to Bill’s Net Worth.\n\nIt’s easy to say that Bill shorted Tesla because it is trading at a price to earnings ratio of 96 during a good economy. And perhaps Bill knows exactly what happens to automakers when the economy suffers, hint… some go bankrupt - RIP Pontiac.\n\nOr, Bill has realized what many are starting to see. What I see at least.\n\nElon’s pay is tied to metrics of Tesla’s stock capitalization. So, the more the stock rises, the richer Elon becomes. \n\nNow any idiot with half a desire to make another dollar would do whatever necessary to make the price go up, what the wannabe wolfs on wall street call “a pump”\n\nElon’s package, which is hard to write with a straight face, is the dump.\n\nSo how exactly do we conclude this is a pump and dump, and not a massively successful and brilliant person working around the clock to ensure the success of every venture?\n\nFor starters, if we include: Tesla, TwitterX, xAI, SpaceX, The Boring Company, Nueralink, and now the Department of Government Efficiency\n\nthat’s seven major organizations that he’s allegedly devoting time to. If you don’t factor traveling or sleeping, or basically any function besides working, it averages out at best for each company he is spending 1 day per week. \n\nIn all reality, some are getting more attention than others, and he most likely delegates any real work to anybody but himself. So yeah, maybe it’s possible.\n\nOr perhaps the success of the other companies is so much less serious because simply put, they were just meant to drive up the price of Tesla.\n\nRemember when Tesla bought bitcoin? They bought in January 2021 for a price of $33,000 and sold in July of 2022 for a price of $23,000.  And since then, Tesla has rallied whenever Bitcoin rallies, even though Tesla sold for a 30% loss. Or remember the dogg coin pump and dump Elon did via tweets?\n\nBy starting all these other companies and ventures, Elon has made people believe in the idea of him. That anything he does is successful. Except, his success, on the backs of other actually brilliant people mind you, is about 3 for 6 with his current engagements. (#7- Department of Government Efficiency can’t be counted yet because it hasn’t happened yet)\n\nTesla - Successful, albeit fraught with troubles from Model 3 production, FSD that’s always a year away, and the Cybertruck which was such a bad vehicle, from concept to build, that it has it’s own subreddit dedicated to mocking it.\n\nTwitter/X - Was successful under it’s deadname, of Twitter, but now it’s become a well known propaganda machine.\n\nxAI - It’s so unsuccessful so far I had to ask Gemini about it, and it told me it’s name is Grok.\n\nSpaceX - Pretty successful venture as far as the goal, maybe not so much the revenue portion, again though, it’s built by other geniuses. Actual ‘Rocket Scientists’\n\nHowever, now it’s becoming it’s own traded company in the form of a Tender Offer, so in theory it shouldn’t have as much association with Tesla. \n\nThe Boring Company - Lol @ Las Vegas. Definitely not a success.\n\nNueralink - Kills monkeys and wants to accomplish the same goal as Twitter/X, which is control peoples thoughts.\n\nIn short, all of these side projects were meant to get people talking about Elon, and Tesla in order to drive up the price. It worked. He became the richest man in the world 3 years ago (2021). When Tesla dropped in 2022, I thought people had finally realized that it wasn’t all it was cracked up to be. But here we are, on the precipice of a wild year that many are already saying will have a major market correction."
    },
    {
        "Title": "I can't wait for quantum computing to literally nuke all you bitcoin and MSTR nerds",
        "Content": "So many people saying \"bitcoin will go to one million in 4 years!!\". \n\nSure, Nvidia will go to $1000 eventually, same with Apple, Google, Meta, etc. Bitcoin's meteoric rise was only impressive in the beginning. **Going from 1 cent to $1000 is kind of a big fucking deal. Going from 100k to 1 million is not.** It's a 10x over the course of 5-8 years, and if it does follow the cycles semi-accurately it'll take about 12 years.\n\nhttps://newsroom.ibm.com/2024-11-13-ibm-launches-its-most-advanced-quantum-computers,-fueling-new-scientific-value-and-progress-towards-quantum-advantage\n\nQuantum computers are becoming mainstream. If IBM already has a 5000 qbit computer, you know that governments already have quantum computers 10x as powerful\n\nHere's the deal- all this \"countries are going to create a national bitcoin reserve\" rumor bullshit is not going to happen. Why?\n\nBTC is very vulnerable to quantum computing. IBM has released a 5000 qbit computer. To break bitcoin, you need a 1 million qbit computer. One day, the news will read \"BITCOIN HACKED\" and it'll drop 95% in hours. I'm sure the CIA is already capable of this, but soon rogue nation states will be as well. Time is ticking.\n\nTICK TOK, YOU BTC REGARDS."
    },
    {
        "Title": "MSTR MSTZ BTC",
        "Content": "The reversal is going to be crazy when BTC flash crashes to $75K or below. This inevitable has to print, wish a regard luck. 3/21/25 exp."
    },
    {
        "Title": "For my next trick $KO",
        "Content": "Hit some good support at $62. Per technicals it should bounce. My DD….support and resistance levels 🫡 last is pic 1mm+ for Feb 62.50 calls today 12.4.24"
    },
    {
        "Title": "You regards are sleeping on WMT",
        "Content": "How is it I never see posts about how WMT is a free money glitch.\n\nStocks, Calls. Both print.\n\nIs it nanas favorite? No, but it's a solid bet. Its not going anywhere.\n\nI am putting more into WMT every week."
    },
    {
        "Title": "BTC Mining Stocks (RIOT, CLSK) will RUN this week and next",
        "Content": "Many of the same financial institutions and portfolio managers that were LONG on BTC were hedging their bets by placing bearish trades on BTC miners and other crypto related stocks like MSTR. It is my strong believe that they will be using some profits off of their long positions to close out their bearish positions on these stocks. "
    },
    {
        "Title": "Bought Bitcoin in 2017 for about 3k I sent it to a different wallet then back to Coinbase and is now above 100k literally turned 3k into 100",
        "Content": "Bought Bitcoin in 2017 for about 3k I sent it to a different wallet then back to Coinbase and is now \nabove 100k literally turned 3k into 100k"
    },
    {
        "Title": "I heard there’s an opening for a new $0 - $1m - $0 guy.  Sending in my application with $38,000 in weekly MSTR options.  ",
        "Content": "✅ "
    },
    {
        "Title": "Palantir's New Clients for November Analysis: Strong Growth Amid Valuation Debate",
        "Content": "Doing some subdomain analysis of Palantir, it appears they added a few big commercial clients in November and also held two more bootcamps, with one in Milan. Despite concerns about potential overvaluation, I believe the company's consistent acquisition of large-market-cap companies, which are finding significant value in their software, indicates that Palantir is well-positioned to grow into its current valuation.\n\n# 1. Medtronic\n\n* **Industry**: Medical Devices\n* **Market Capitalization**: Approximately **$110 billion**\n\n# 2. Walmart\n\n* **Industry**: Retail\n* **Market Capitalization**: Approximately **$420 billion**\n\n# 3. Flipkart\n\n* **Industry**: E-commerce\n* **Note**: Flipkart is a private company majority-owned by Walmart. In 2021, it was valued at around **$37.6 billion** during a funding round. However, since it's not publicly traded and to avoid double-counting with Walmart's market cap, we'll exclude it from the total.\n\n# 4. Fujitsu\n\n* **Industry**: Information Technology\n* **Market Capitalization**: Approximately **$25 billion** (converted from Japanese Yen)\n\n# 5. Sherwin-Williams\n\n* **Industry**: Paints and Coatings\n* **Market Capitalization**: Approximately **$60 billion**\n\n# 6. Martin Marietta\n\n* **Industry**: Building Materials\n* **Market Capitalization**: Approximately **$25 billion**\n\n# 7. Isar Aerospace\n\n* **Industry**: Aerospace\n* **Note**: Isar Aerospace is a private company, so market capitalization data is not publicly available.\n\n# 8. JK Cement Limited\n\n* **Industry**: Cement Manufacturing\n* **Market Capitalization**: Approximately **$3 billion** (converted from Indian Rupees)\n\n# 9. Meijer\n\n* **Industry**: Supercenter Retail\n* **Note**: Meijer is a private company, and its market capitalization is not publicly available.\n\n"
    },
    {
        "Title": "Woke up this morning, decided if i was gonna blow up. I’d do it with MSTR",
        "Content": "Felt uneasy last night with PLTR, decided if i was going out im going out with the stock of my dreams MSTR. Someone tell me this is the comeback to 1M. I will carry the fucking boats. I WILL CLIMB BACK TO THE TOP, I REFUSE TO DIE. I WILL HOLD THESE FUCKING POSITIONS TILL I HEAR THE BELL ON FRIDAY. "
    },
    {
        "Title": "NVIDIA's Rubin architecture to be released six months early",
        "Content": "NVIDIA's Rubin architecture to be released six months early"
    },
    {
        "Title": "Roku’s real value is in the data.",
        "Content": "I want you to ask yourself a question:\n\nHow valuable are the things we pay attention to? \n\n**Half** of American households have a Roku device.\n\nRoku is the leading streaming TV distributor in the U.S., reaching nearly 120 million people.**Roku's audience is larger than the subscribers of the six largest traditional pay-TV providers combined.** It is the #1 smart TV streaming OS in the US, Canada and Mexico.\n\nSource: https://developer.roku.com/docs/features/features-overview.md\n\nAs of the third quarter of 2024, Roku has 85.5 million active accounts worldwide, which is the company's highest ever, a 12.8% increase from Q3 2023.\n\nStreaming time per active user: 246.8 minutes per day in Q3 2024, a 5.8% increase from Q3 2023\n\nAs part of Roku’s privacy policy, they collect:\n\n“Information about your activities, like the channels you install or access (including usage statistics such as what channels you access, the time you access them, and how long you spend viewing them), and information about the videos and other content you select and stream within these streaming services. If you use the Roku Media Player to view your video or photo files or listen to your music files, Roku will collect data about the files viewed within the Roku Media Player, such as codecs, and other metadata of the local files you play.”\n\nhttps://docs.roku.com/published/userprivacypolicy/en/us\n\nWhy do you think they practically give away their streaming sticks? The money isn’t in their devices, it’s in the data they collect on you. \n\nGoogle’s in a similar business. They have 4.97 billion users, and their market cap is 2.14 Trillion. The valuation is 428x the amount of users.\n\nIf we applied the same multiples, that means $ROKU is worth around a 37 Billion dollar market cap, putting $ROKU at $250 a share. \n\nI’d venture to say it’s more around $750 a share, given the majority of Roku’s users are in the US.\n\nLet’s see what this holds.\n"
    },
    {
        "Title": "HSA Yolo, A LAB a day keeps the red away",
        "Content": "https://preview.redd.it/tmdyavg0kx4e1.jpg?width=1179&amp;format=pjpg&amp;auto=webp&amp;s=355a135639e042b3f8f890493332666b438f6a0c\n\n"
    },
    {
        "Title": "BULLISH ASF ON $HOOD",
        "Content": "TL;DR: \nRobinhood’s Investor Day highlighted massive growth opportunities, including expanding crypto offerings (20 to 260 tokens), entering institutional trading, and exploring sports betting with innovative products like event contracts. The company’s profitability, $600B TAM, and focus on global expansion position it as a long-term fintech powerhouse. I’m bullish AF on $HOOD, with a $55 call expiring in 2027 and plans to buy shares monthly.\n______________________________________\nPost:\n\nGood Evening my fellow WSB Regards!\n\nI’ve attached the link to the post so you can check out Robinhood’s Investor Presentation or watch the livestream from earlier today yourself. Trust me, it’s worth a look if you want to dig into the details.\n\nI apologize in advance if this post looks like a bag of ass. I’m posting from my phone, and Reddit is making it harder to edit this than it should be. But trust me—if it’s readable enough, you’re gonna want to stick around and read through this because there’s some serious juice here.\n\nAfter watching parts of the livestream, reading through their Investor Presentation, and sprinkling in some speculation, here’s why I think you should be bullish on $HOOD for the short-term, near-term, long-term, and forever:\n\n_____________________________________\n1. Short-Term Growth Drivers\n\n•Staking Expansion: Robinhood’s staking rollout in Europe has already onboarded $4M+ in assets, with 24% of Solana staked on the platform. A broader U.S. rollout is on the horizon and could significantly boost revenues and user engagement.\n\t\n•Crypto Expansion: Robinhood currently supports 20 crypto tokens but has plans to scale to match Coinbase’s 260 assets. This expansion will attract more active traders and drive Robinhood’s share of the growing crypto market.\n\n•Profitable Growth: Robinhood hit $2.4B in LTM net revenue (up 36% YoY) and $949M in adjusted EBITDA (up 96% YoY). They’re no longer just a disruptor—they’re now a profitable fintech powerhouse.\n\n___________________________________\n2. Near-Term Strategic Initiatives\n\n•Institutional Crypto Market: Institutional trading makes up 80% of crypto volume, and Robinhood is moving into this space through partnerships and acquisitions. By offering low-cost trading, they’re positioned to capture a huge chunk of this untapped revenue.\n\n•Robinhood Legend: Their new desktop platform, Robinhood Legend, is targeting the 50% of retail trading volume conducted on web-based platforms. This move aims to win over users who currently trade with incumbents.\n\t\n•Global Expansion: With plans to launch brokerage services in Asia (2025) and expand crypto offerings in Europe, Robinhood is scaling up globally and positioning itself as a major player in multiple markets.\n\n___________________________________\n3. Long-Term Vision and Opportunities\n\n•10-Year Vision: Robinhood is gunning to become the #1 platform for active traders, dominate wallet share, and establish a global financial ecosystem. The endgame? Hold all customer assets and manage every transaction.\n\t\n•$600B TAM (Total Addressable Market):\n\t\n•$20B+ from active traders.\n\t\n•$180B+ from wallet share expansion via products like Robinhood Gold.\n\t\n•$400B+ from tokenization, staking, and institutional services.\n\t\n•Untapped Opportunities: Robinhood plans to introduce new products like mutual funds, fixed income, trust accounts, and 529 accounts, adding even more revenue streams.\n\n___________________________________\n4. Exploring Sports Betting\n\nDuring the Q&amp;A, Robinhood leadership was asked about adding sports betting. They explained that while their Event Contracts fall under federal CFTC regulations, traditional sports betting is state-regulated. However, they’re exploring the space, and here’s why this could be huge:\n\t\n•Gen Z: Around 20-25% of Gen Z already bets on sports, and this percentage is rising.\n\t\n•Millennials: 30-40% of Millennials are active in sports betting.\nAdding sports betting could diversify Robinhood’s offerings and attract younger users, tapping into a lucrative and growing market.\n\n___________________________________\nKey Growth Catalysts\n\n1.Crypto Leadership: Robinhood’s low-cost staking and trading features, along with its plan to expand from 20 to 260 crypto assets, position it as a leader in the fast-growing crypto market.\n\t\n2.Diversified Revenue Streams: With nine product lines generating $100M+ annually, Robinhood is no longer dependent on just one revenue stream.\n\t\n3.Customer Value: Robinhood has delivered $34B+ in value to customers through lower fees, better yields, and innovative features.\n\n__________________________________\nWhy Robinhood Stands Out\n\n•Low-Cost Leadership: Robinhood continues to offer industry-leading low fees across equities, options, and crypto, making it the go-to platform for cost-conscious traders.\n\t\n•Technological Innovation: Tools like Robinhood Legend and AI-driven products keep the company ahead of its fintech peers.\n\t\n•Expanding Global Reach: Expansion into Asia and Europe cements Robinhood’s position as a global financial leader.\n\n\n___________________________________\nInvestment Thesis:\n\nRobinhood’s combination of profitability, innovation, and expansion into untapped markets makes it a standout growth stock. With plans to enter institutional trading, expand crypto services (scaling from 20 to 260 tokens), and explore sports betting, the company is diversifying its revenue streams and positioning itself for sustained long-term success.\n\n___________________________________\nA Unique Path to Dominance:\n\nRobinhood stands to benefit significantly from the likely deregulatory policies of a Trump administration, which historically prioritizes free-market policies and reduces financial regulations. This could streamline approvals for new products like staking and tokenization while easing restrictions on crypto and trading practices. Additionally, deregulation might open the door for Robinhood to aggressively expand into areas like sports betting, enhancing its product pipeline and competitive edge.\n\n_______________________________\nConclusion: Robinhood isn’t just a disruptor—it’s a company with the vision and roadmap to dominate the financial markets. For those looking for a high-growth fintech stock with global ambitions, $HOOD is a play worth watching.\n\nConsidering that most of us degenerates use Robinhood because we already know how beast this platform is, I’m surprised I have not seen a lot of posts on it. With these numbers, this beast of a company deserves way more attention.\n\n_________________________________\nMy Position:\n\nCurrently, I’ve got (1) HOOD $55 Call 1/15/27 because I’m broke asf right now, but I plan to buy shares monthly until the expiration date of the contract. Considering how much potential this stock has, I might actually go ahead and execute the contract.\n[Investor Day Livestream &amp; Presentation](https://investors.robinhood.com/upcoming-events/events/event-details/2024/Robinhood-Investor-Day-2024-2024-Jy2w81uBO_/default.aspx)\n\n——————————————————————————\nEdit: I’m adding this note because of a comment I received (and might get more of), just to be completely transparent. This post was formatted and revised by ChatGPT to improve readability, correct spelling and grammar, and keep me from going on unnecessary tangents. I’m not doing this to be lazy—I work full-time, go to school, and by the time 6 PM rolls around, my ADHD brain is pretty fried.\n\nI’ve personally gone through Robinhood’s 210-slide Investor Day presentation, read other takes on X, and reviewed articles from SeekingAlpha and Barron’s in regards to the Investor Day news. I also caught the last 40 minutes of the livestream where they mentioned sports betting. The analysis and opinions here are mine—ChatGPT was just used to make the post easier to read, and that’s it.\n"
    },
    {
        "Title": "Service Titan IPO -&gt; Getting Weird ",
        "Content": "[https://techcrunch.com/2024/12/03/servicetitans-ipo-keeps-getting-weirder/](https://techcrunch.com/2024/12/03/servicetitans-ipo-keeps-getting-weirder/)\n\n  \nThe IPO valuation is half of that of earlier funding rounds. They're not profitable, still valued at a crazy multiple. This may be a great short-sell candidate."
    },
    {
        "Title": "I know it’s not much, but I took my first step into investing!",
        "Content": "Any tips? I’m not trying to put too much in until I become more educated. I do have a HYSA, 401k and an ESPP with my company so this is more for fun right now until I can get more serious with it."
    },
    {
        "Title": "Let’s Talk Strategies, Lessons, and Staying in the Game",
        "Content": "So, after being in the trading game for a while now, I figured it’d be cool to start a laid-back convo about the ups, downs, and lessons we’ve all learned along the way. Trading is one of those things where you never stop learning, no matter how long you’ve been at it, right?\n\n\n\nFor me, the biggest game-changer was nailing down a solid risk management plan. Like, it’s not the most exciting part of trading, but man, it’s what keeps you alive in the market. That, and not chasing every shiny setup that looks good for half a second.\n\n\n\nAnyway, here are some things I’m curious about:\n\n\n\n\\- What’s your bread-and-butter strategy? Are you more of a trend trader, swing trader, or long-term investor?\n\n\\- What was your biggest “aha” moment that took your trading to the next level?\n\n\\- How do you keep emotions in check especially during those wild, volatile days?\n\n\\- Got any tools, books, or resources that you swear by?\n\nLet’s swap stories, tips, or even just rant about those trades that made no sense but somehow worked (or didn’t). Whether you’re a seasoned vet or just feeling like you’ve hit your groove, I’m down to hear what’s working for you and what’s not.\n\n\n\nLet’s help each other out and keep the good vibes going. "
    },
    {
        "Title": "These are the stocks on my watchlist (12/4)",
        "Content": "\n\nHi! I am an ex-prop shop equity trader.\n\nThis is a daily watchlist for trading: I might trade all/none of the stocks listed, and even stocks not listed! I only hold some/all MAG 7 stocks and market indices long-term. If you use Old Reddit, click “Show Images” at the top to expand the charts. Any positions stated aren’t recommendations, I’m following subreddit rules to disclose positions. I use IBKR TWS for my platform and charts.\n\nI am targeting potentially good candidates to day trade; I have no opinion on them as investments. This means the potential of the stock moving today is what makes it interesting, not the business, long-term prospects, or the people involved.\n\nPLEASE ask specific questions and PLEASE don’t ask about earnings because I typically don’t take positions before earnings announcements. Questions like “Thoughts on \\_\\_\\_\\_\\_?” or “Why isn’t \\_\\_\\_ on the watchlist?” or something answered already will be ignored unless you add detail and your opinion.  If you post a question and delete it after I answer it, I will block you- doing that hurts discussion. I am not answering questions if I’m still long or short a stock beyond what I update.\n\nNews: [South Korea Opposition Party Seeks To Impeach Yoon For Treason M49Amyj3](https://www.bloomberg.com/news/articles/2024-12-04/south-korea-opposition-party-seeks-to-impeach-yoon-for-treason-m49amyj3)\n\n[**CPNG**](https://finviz.com/quote.ashx?t=CPNG&amp;p=d) \\- Watching the situation in South Korea still, currently long. \n\nhttps://preview.redd.it/kzdgamt5bu4e1.png?width=1539&amp;format=png&amp;auto=webp&amp;s=afb5ee51bacb343d952058f140033ea5f364b3ec\n\n[**FL**](https://finviz.com/quote.ashx?t=FL&amp;p=d) \\- Shares fall due to weak consume demand and steep promotions across sneaker marketplace. EPS of .33 vs .41 expected, revenue of $1.96B vs $2.01B expected.\n\nhttps://preview.redd.it/94xdcjz8bu4e1.png?width=1529&amp;format=png&amp;auto=webp&amp;s=a5de6a72c65dbf16ce1792d0a03da4ef5d672c37\n\n[**PLTR**](https://finviz.com/quote.ashx?t=PLTR&amp;p=d) \\- (Yesterday's news) Achieved new government security designation, sending stock to ATH. Watching $75 level, but biased short. No position.\n\nhttps://preview.redd.it/fs9q8g6abu4e1.png?width=1539&amp;format=png&amp;auto=webp&amp;s=a645647e23a34f36f6345407d9f533a464e7d5b1\n\n[**OKTA**](https://finviz.com/quote.ashx?t=OKTA&amp;p=d) \\- EPS of .67 vs .58 expected, revenue of $665M vs $650M exp. Success attributed due to investments made in partner ecosystem and public sector vertical.\n\nhttps://preview.redd.it/iubph4bcbu4e1.png?width=1534&amp;format=png&amp;auto=webp&amp;s=ca6e3c89f6f9ceecc77248f3ec400459b8df47b5\n\n[**MP**](https://finviz.com/quote.ashx?t=MP&amp;p=d) \\- (Yesterday's news) Moving off of China's ban of key minerals to the US, still worth watching. \n\nhttps://preview.redd.it/tonrbikdbu4e1.png?width=1533&amp;format=png&amp;auto=webp&amp;s=4076e956c680bfbdc83cb4c97ffafc74b491e3bc\n\nEarnings: [**S**](https://finviz.com/quote.ashx?t=S&amp;p=d), [**AEO**](https://finviz.com/quote.ashx?t=AEO&amp;p=d)"
    },
    {
        "Title": "A short critique of Ray Dalio",
        "Content": "Ray Dalio has done an absolutely amazing job with Bridgewater Associates - kudos to him. However, I find that his viewpoints and his analyses, especially when it comes to China, are highly biased and, to an extent, nonsensical. Dalio has historically been a strong proponent of China, emphasizing its potential to surpass the US in economic dominance and advocating for the yuan taking the place of the USD as the next reserve currency. He held these views as recently as 3-5 years ago, but it feels like his stance has now moderated given what has happened in the last couple of years.\n\nDalio's earlier optimism about China's trajectory was grounded in its rapid economic growth, infrastructure development, and increasing global influence. Even at that time, several experts pointed out that he was underestimating structural issues such as China's aging population, mounting debt, and a slowing economy - something that he didnt seem to pay much heed to as he continued to toot the China horn. \n\nChina's demographic crisis, with its shrinking workforce and rapidly aging population, has significantly impacted its long-term growth prospects. Geopolitical tensions, regulatory crackdowns on industries, and a cooling real estate market have further dampened investor sentiment. Which Dalio can finally see - quite late for an \"expert\", I feel\n\nRecently, Dalio has changed his tune, almost ackowledging his mistake as he referred to China's situation as \"more challenging than Japan in 1990\". The arrogance he once had seems to have disappeared as he now emphasizes the need for caution and diversification, reflecting a shift from his earlier, unqualified enthusiasm to a more nuanced perspective​."
    },
    {
        "Title": "Daily General Discussion and Advice Thread - December 04, 2024",
        "Content": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&amp;#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&amp;#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!"
    },
    {
        "Title": "Powell says he’s not worried about the Fed losing its independence under Trump",
        "Content": "Powell says he’s not worried about the Fed losing its independence under Trump"
    },
    {
        "Title": "Banxa Holdings Inc. $BNXA",
        "Content": "$Banxa Holdings Inc (BNXA.CA)$ (on the TSX-V)\nBanxa has just had their first ever breakeven quarter. We will likely see their first ever profitable quarter in a few months with the current crypto climate. \n\nBanxa fair value is probably around $4.00 a share but with the hype I can see it going to $8.00 again by Spring 2025. \n\nBanxa is an crypto on-ramping business. Think it like a baby Coinbase. \n\nLast crypto cycle 4 years ago Banxa hit $8.30. Since then there has been next to no dilution and most shares are held by insiders. \n\nThere could be very significant profit to be made in just the next few months here. Good luck and do your own due diligence.\n\nLet me know if you have any questions. I have been trading and following Banxa Holdings since they first went public in January 2021. "
    },
    {
        "Title": "Put everything I have outside of retirement on mortgage?",
        "Content": "For the last near decade I’ve lived a very modest life. Spending very little money on any pleasure. I’ve lived with family and saved essentially everything and have amassed $200k in a HYSA and another $150k invested in a taxable brokerage account, on top of my retirement funding. Capital gains in the taxable are only around $25k, as I recently started non retirement investing, so a lot of that is principle.\n\nRecently bought a $500k home with a 7% mortgage. I put $100k down to avoid PMI, taking my cash level down to $100k from $200k\n\nI’m wondering if I should drop my cash reserves down to $25k as my emergency fund, and liquidate everything in my taxable and put $225,000 on my $400,000 mortgage, which will leave me with $175,000 left owed and $25,000 remaining outside of retirement. \n\nI can save $30-40k a year, so that means in order to pay off the mortgage, for the next 5 years I’d have to put every additional dollar I have on the house on top of this liquidation and keeping my funds down at the bare bones $25k level. In 5 years I would essentially have a paid for $500k house and $25k in cash to my name - this all is if I don’t get married and “life happens”. Anything outside of this dedicated plan would add more years to payoff. \n\nOn the other hand, I could keep the $150,000 growing in the markets and keep investing as I have been before taking on this mortgage - And then refinance my loan at a later date.\nTechnically right now I could have close to $225k invested if I chose to invest everything down to that $25k level instead of using it for the mortgage. \n\nI am having trouble deciding on what to do"
    },
    {
        "Title": "Does this time remind you of the dot-com era?",
        "Content": "Man, I have to say living through that time in the late 90's where everyone and their grandmother were giving you tech stock advice was a surreal time. I was new to the industry, but it was hitting this fever pitch where hard working everyday folks were moving all of their hard earned life savings into 100% dot com stocks - just dreaming to strike it rich like all their friends. I could only imagine the conversations that followed with their loved ones, when the entire market dropped out from under them. I wanted so much to say \"I told you so\" ... but was honestly too heartbroken for them.\n\nFast forward to today. Even with Bitcoin/Crypto's use case being very compelling ... I can't help but to get flash backs of the dot-com era. This euphoria has occurred before, and I hate to think that history will repeat itself again (which it more than likely would, as I'm hearing people talk and act the same way).\n\nThere's no question these are exciting times, but can't help but to have PTSD ... with visions of people losing the shirt off their backs. Anyone else lived through that time and feel the same way?"
    },
    {
        "Title": "Am I entering in the stop limit correctly?",
        "Content": "I'm currently investing in a crypto in which my average buy in cost was 1.94. I want to create a stop limit that sells all of my shares if the price falls below 2.10. I see 3 different categories on coinbase when trying to execute this order. Stop price, limit price and amount. Is stop price and limit price the same thing? Would I put 2.1 in both of those categories? Coinbase also wants to charge me a fee for this transaction. However I will not pay the fee unless the transaction goes through, right? I also see limit and stop limit under order type. What is the difference between these 2 categories?"
    },
    {
        "Title": "I want to start investing ",
        "Content": "I’m 15 and I wanna buy stock or crypto, I saw that Reddit keeps going higher and higher by the day and I put $20 in it. I remember about 2-3 years ago I saw people preaching the hell out of XRP and now it’s huge, I was just wondering if you guys had any tips for me since I don’t know much yet "
    },
    {
        "Title": "PSA: PE Ratios Don’t matter - You’re missing out on gains!",
        "Content": "PE ratios are just numbers. That’s it—they don’t inherently mean anything.\n\nLook at companies like TSLA, NVDA, WMT, and COST. These are market leaders in their respective sectors with massive competitive moats. These companies are built to weather almost any economic environment and are likely to be around for decades. Betting against them based on valuation metrics like PE ratios is shortsighted.\n\nPeople who avoided investing in Amazon, Walmart, or Google in their earlier years because of “high valuations” missed out on generational wealth-building opportunities. History shows that great companies often earn their high valuations by continuing to dominate and expand.\n\nAnd before someone inevitably brings up Enron or other frauds—those are completely different scenarios. Those collapses were driven by accounting scandals and a lack of actual business fundamentals. TSLA, NVDA, and others are the opposite: they have solid growth prospects, cutting-edge innovation, and established track records.\n\nInstead of obsessing over traditional valuation metrics, focus on the quality of the business, its leadership, and its long-term potential. Don’t let PE ratios scare you away from companies that could define the future."
    },
    {
        "Title": "I put a lot more funds into my regular brokerage than my Roth IRA. How unwise is this?",
        "Content": "I like the idea of being able to access my money before 59 without penalty so it makes more sense to me to invest mostly in a regular brokerage, is this a bad idea? \n\nI hear often that you should max your Roth IRA first, then contribute whatever is left into your other accounts, but I still don’t fully get why I would do that if I want to access those funds before 59. Appreciate any responses"
    },
    {
        "Title": "Does Gen Z invest in stocks or cryptos?",
        "Content": "What I am asking is whether there is a chance for cryptocurrencies to replace stocks as the primary investment for the next generation, and what the implications are for those of us who primarily invest in the stock market. Does the intrinsic value of a stock matter if there is no demand to drive the price up?"
    },
    {
        "Title": "Wild Investigation of Finfluencer Sponsors by The Plain Bagel",
        "Content": "This investigation by The Plain Bagel is pretty wild. He collected sponsorship data from a bunch of finance influencers and looked into the price return of these companies. What he reported is pretty crazy. For example, the majority of them reported no sales for the last 12 months. Check the full video [here](https://www.youtube.com/watch?v=-Q3g-6jFl2c). "
    },
    {
        "Title": "What is this 4% rule everyone is talking about?",
        "Content": "I am having difficulty understanding what it exactly means. I heard 3 different things.\n\n1: you can withdraw 4% of your money and it will remain the same amount. Example: you pull out 4% of 1mil and you still have 1 mil.\n\n2: you can withdraw 4% of your money and it will probably go up AND you get that 4%\n\n3: you can withdraw 4% of your money and HOPEFULLY you don't run out.\n\nSo, which is it? And where is this magical 4% coming from??"
    },
    {
        "Title": "My parents invest with a hedge fund. I think they are doing worse than the S&amp;P. What do I need to confirm this?",
        "Content": "I know next nothing about investing except that the purpose of having someone invest for you is that they outperform the S&amp;P 500 and they do so after whatever fees they take.  What information do I need to look at it confirm how they are doing vs the S&amp;P 500.  They have been investing with this fund for about 12 years now"
    },
    {
        "Title": "Starting from ground 0 and all of this is quite overwhelming.",
        "Content": "I’m 35 years old and have no hopes of financial freedom before I die, I will work until my heart stops ticking.\n\nCovid completely wiped me out, I work in the hospitality field, have very little bills, and almost no debt.\n\nI just accepted a job offer that will provide stability but they don’t offer 401k and I doubt I could max out a Roth IRA.\n\nWhat does my generation do, what can I do to even feel like I’m not wasting my time, trying to get ahead of something that is impossible?\n\nIm all ears because investing is interesting to me.\n\nTake care and have a good night 🫡 "
    },
    {
        "Title": "New to trading, need some advice for future investment.",
        "Content": "Hey folks! As the title reads i''m relatively new to trading and could need some advice for future investment. No risky stuff, just some stocks who generated more rendit than putting it in a bankaccount.\n\nSo far i took amzn, which worked quite well so far, i'm gonna keep it till the retours after christmas, i guess.\n\nThe stock which made me interested in trading even more was RHM, (Rheinmetall) which is a big employer in my area. \n\nThought it be a bank like a month ago (since the conflict in UA is ongoing). I started like two weeks ago, buying and holding this share.\n\nThey now announced to built an ammunition plant in Lithuiania like two days ago and i could sell with 120 € plus on my 2.5k investment. \n\nSeems to easy. When do i sell?\n\nKind regards from Germany."
    },
    {
        "Title": "Thoughts on public-facing private markets strategies?",
        "Content": "Ive recently come across various private markets investing platforms that apparently allow \"normal\" people to invest in PE, Private Credit, and similar things. From what ive seen, there are various companies that offer different products:\n\n1. Arta Finance - minimum 10k investment, it seems that its like actually investing in a specific fund at KKR or similar, just at a lower price point and with more people\n2. Yieldstreet - seems to offer a mix portfolio of private investments oriented around growth or income, basically crafting a guided investment platform with privates\n3. Goldman Sachs / JPM / other banks- seem to offer evergreen private markets funds that work the same as a mutual fund with low minimums, but some minimums are still 50k+\n\nHas anyone used any of these? Any good low-minimum options for private investing outside of micro lending or crowdsource investment platforms?"
    },
    {
        "Title": "Which ETF would be best for me to start with? VOO, SPY, or VTI?",
        "Content": "I am finally beginning to take my retirement seriously even if it may be a bit late.\nI do have a company pension. Apart from that I have never opened a Roth or a HYSA.  I do also have about 53 k in a teacher retirement account from a previous careers/org.  I can comfortably buy a share of VTI once per month, maybe SPY if I really commit.\nAlso I am thinking of moving my bank savings into a brokerage account where it at least gains 4.75 APY.  \nMy other thoughts are rolling the teacher retirement into a Roth, either one as I see my income going down to say less than current tax bracket it’s on. \nJust wanted to get some thoughts, I know it’s a lot. TIA"
    },
    {
        "Title": "HSA Investing Question - Plz Help",
        "Content": "Hello! I work for a credit union in the Midwest. I contribute to my 401(k) and HSA. They opened up an HSA checking account along with my normal checking &amp; savings account. They put my contributions in the HSA checking account but I was wondering if I can open up a fidelity account to invest my HSA funds. Is this allowed? "
    },
    {
        "Title": "17 year old looking for some long term investment ideas",
        "Content": "This is not my first rodeo with the stock market, I've been trading since 2020 (13), and the only two major long term investments that I have is Apple and VTI, both serving me greatly. I would consider Rivian to also be a long term stock, but it is more risky than the other two. My portfolio mainly consists of Tech stocks as for it is a market I am actively participating in and informed about, but I'm open to broadening markets. \n\nI was either planning on dumping more money into VTI, however as it reached $300 It became a bit too expensive for me to want to invest more in. Something I'm more concerned about is a crash, especially in the tech market as for it is reaching all time highs, but from what the tech market has shown in the past decade, is UP with some downs obviously. I know VOO and other vanguard ETF's are shown to do really well, but most of them are expensive, but in the end it may just be worth it. "
    },
    {
        "Title": "Need Advice for Investing Funds Moved to a 401K Rollover",
        "Content": "Content could not be retrieved"
    },
    {
        "Title": "Seeking Advice: Stock Sale or Margin Loan/HELOC for Home Renovation",
        "Content": "Content could not be retrieved"
    },
    {
        "Title": "What is the science behind item 1a in 10-k filings?",
        "Content": "Content could not be retrieved"
    },
    {
        "Title": "Index universal life insurance",
        "Content": "Content could not be retrieved"
    },
    {
        "Title": "Thoughts on this investment plan for the next 20 years?",
        "Content": "Content could not be retrieved"
    },
    {
        "Title": "Rethinking Emergency Fund",
        "Content": "Content could not be retrieved"
    },
    {
        "Title": "Just crossed 100% return on my company's employee stock plan. What to do?",
        "Content": "Content could not be retrieved"
    },
    {
        "Title": "How can someone learn and be better at options ",
        "Content": "Content could not be retrieved"
    }
]